GComPI-IFPB/openmote-fw/platform/cc2538/cc2538_include.h
/**
 * @file       cc2538_include.h
 * @author     Pere Tuset-Peiro (peretuset@openmote.com)
 * @version    v0.1
 * @date       May, 2015
 * @brief
 *
 * @copyright  Copyright 2015, OpenMote Technologies, S.L.
 *             This file is licensed under the GNU General Public License v2.
 */

#ifndef CC2538_INCLUDE_H_
#define CC2538_INCLUDE_H_

/*================================ include ==================================*/

#include "src/adc.h"
#include "src/aes.h"
#include "src/ccm.h"
#include "src/cpu.h"
#include "src/debug.h"
#include "src/flash.h"
#include "src/gpio.h"
#include "src/gptimer.h"
#include "src/i2c.h"
#include "src/interrupt.h"
#include "src/ioc.h"
#include "src/pka.h"
#include "src/rom.h"
#include "src/sha256.h"
#include "src/sleepmode.h"
#include "src/ssi.h"
#include "src/sys_ctrl.h"
#include "src/systick.h"
#include "src/uart.h"
#include "src/udma.h"
#include "src/watchdog.h"

#include "inc/hw_aes.h"
#include "inc/hw_ana_regs.h"
#include "inc/hw_cctest.h"
#include "inc/hw_flash_ctrl.h"
#include "inc/hw_gpio.h"
#include "inc/hw_gptimer.h"
#include "inc/hw_i2cm.h"
#include "inc/hw_i2cs.h"
#include "inc/hw_ints.h"
#include "inc/hw_ioc.h"
#include "inc/hw_memmap.h"
#include "inc/hw_nvic.h"
#include "inc/hw_pka.h"
#include "inc/hw_rfcore_ffsm.h"
#include "inc/hw_rfcore_sfr.h"
#include "inc/hw_rfcore_xreg.h"
#include "inc/hw_smwdthrosc.h"
#include "inc/hw_soc_adc.h"
#include "inc/hw_ssi.h"
#include "inc/hw_sys_ctrl.h"
#include "inc/hw_types.h"
#include "inc/hw_uart.h"
#include "inc/hw_udma.h"
#include "inc/hw_udmachctl.h"
#include "inc/hw_usb.h"

/*================================ define ===================================*/

/*================================ typedef ==================================*/

/*=============================== variables =================================*/

/*=============================== prototypes ================================*/

/*================================= public ==================================*/

/*================================ private ==================================*/

#endif  /* CC2538_INCLUDE_H_ */
